Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: After defining your tests, you can run them with RUN_ALL_TESTS(), which returns 0 if all the tests are successful, or 1 otherwise.
it_it: Dopo aver definito tuoi test, si possono eseguire con RUN_ALL_TESTS(), che restituisce 0 se tutti i test hanno esito positivo, o 1 in caso contrario.

source: After defining your tests, you can run them with `RUN_ALL_TESTS()`, which returns `0` if all the tests are successful, or `1` otherwise.
it_it: Dopo aver definito tuoi test, si possono eseguire con `RUN_ALL_TESTS()`, che restituisce `0` se tutti i test hanno esito positivo, o `1` in caso contrario.

source: After that, our test suite is complete and we can safely exit.
it_it: Successivamente, la nostra suite di test è completa e possiamo uscire in sicurezza.

source: After the change, it would look like:
it_it: Dopo la modifica, sarebbe simile a:

source: After the process, you should have something like:
it_it: Alla fine del processo, si dovrebbe avere qualcosa del genere:

source: After you've come up with your answer, take a look at ours and compare notes (solve it yourself first - don't cheat!):
it_it: Dopo aver trovato la risposta, date un'occhiata alla nostra e confrontate le note (da risolvere in autonomia - non imbrogliare!):

source: All Expectations Are Sticky (Unless Said Otherwise) {#StickyExpectations}
it_it: Tutte le expectation sono fisse (a meno che non venga detto diversamente) {#StickyExpectations}

source: All actions are defined in the ::testing namespace.
it_it: Tutte le azioni sono definite nel namespace ::testing.

source: All actions are defined in the `::testing` namespace.
it_it: Tutte le azioni sono definite nel namespace `::testing`.

source: All arguments of the mock function as a tuple
it_it: Tutti gli argomenti della funzione mock come una tupla

source: All assertion macros support streaming a custom failure message into them with the << operator, for example:
it_it: Tutte le macro di asserzione supportano lo streaming di un messaggio di errore personalizzato con l'operatore <<, ad esempio:

source: All assertion macros support streaming a custom failure message into them with the `<<` operator, for example:
it_it: Tutte le macro di asserzione supportano lo streaming di un messaggio di errore personalizzato con l'operatore `<<`, ad esempio:

source: All current build systems support pkg-config in one way or another.
it_it: Tutti i sistemi di build attuali supportano pkg-config in un modo o nell'altro.

source: All expectations will be verified when mock_function
it_it: Tutte le expectation verranno verificate quando mock_function

source: All gMock symbols are in the testing namespace unless they are macros or otherwise noted.
it_it: Tutti i simboli gMock si trovano nel namespace testing a meno che non siano macro o diversamente indicati.

source: All gMock symbols are in the `testing` namespace unless they are macros or otherwise noted.
it_it: Tutti i simboli gMock si trovano nel namespace `testing` a meno che non siano macro o diversamente indicati.

source: All matchers are defined in the ::testing namespace unless otherwise noted.
it_it: Tutti i matcher sono definiti nel namespace ::testing se non diversamente specificato.

source: All matchers are defined in the `::testing` namespace unless otherwise noted.
it_it: Tutti i matcher sono definiti nel namespace `::testing` se non diversamente specificato.

source: All of these matchers, except ContainsRegex() and MatchesRegex() work for wide strings as well.
it_it: Tutti questi matcher, tranne ContainsRegex() e MatchesRegex() funzionano anche per stringhe "wide".

source: All of these matchers, except `ContainsRegex()` and `MatchesRegex()` work for wide strings as well.
it_it: Tutti questi matcher, tranne `ContainsRegex()` e `MatchesRegex()` funzionano anche per stringhe "wide".

source: All tests registered with the same test_suite_name must return the same fixture type.
it_it: Tutti i test registrati con lo stesso test_suite_name devono restituire lo stesso tipo di fixture.

source: All tests registered with the same `test_suite_name` must return the same fixture type.
it_it: Tutti i test registrati con lo stesso `test_suite_name` devono restituire lo stesso tipo di fixture.

source: All you need is a call operator with a signature compatible with the mocked function.
it_it: Tutto ciò di cui si ha bisogno è un operatore di chiamata con una firma compatibile con la funzione mock-ata.

source: Allocate a number of machines (shards) to run the tests.
it_it: Allocare un certo numero di macchine (shard) per eseguire i test.

source: Allows a user to specify the default value for a type T that is both copyable and publicly destructible (i.e. anything that can be used as a function return type).
it_it: Consente all'utente di specificare il valore di default per un tipo T che è sia copiabile che pubblicamente distruttibile (ovvero qualsiasi cosa che possa essere utilizzata come tipo restituito da una funzione).

source: Allows a user to specify the default value for a type `T` that is both copyable and publicly destructible (i.e. anything that can be used as a function return type).
it_it: Consente all'utente di specificare il valore di default per un tipo `T` che è sia copiabile che pubblicamente distruttibile (ovvero qualsiasi cosa che possa essere utilizzata come tipo restituito da una funzione).

source: Allows the value-parameterized test suite *`TestSuiteName`* to be uninstantiated.
it_it: Consente di annullare l'istanza della test suite con valori parametrizzati *`TestSuiteName`*.

source: Allows the value-parameterized test suite TestSuiteName to be uninstantiated.
it_it: Consente di annullare l'istanza della test suite con valori parametrizzati TestSuiteName.

source: Also, containers used in tests often have a small number of elements, and having to define the expected container out-of-line is a bit of a hassle.
it_it: Inoltre, i container utilizzati nei test hanno spesso un numero limitato di elementi e doverli definire [out-of-line] è un po' complicato.

source: Also, derived classes still have access to shared resources defined as static members, so careful consideration is needed when managing shared resources to avoid memory leaks if shared resources are not properly cleaned up in TearDownTestSuite().
it_it: Inoltre, le classi derivate hanno ancora accesso alle risorse condivise definite come membri statici, quindi è necessaria un'attenta considerazione quando si gestiscono le risorse condivise per evitare "memory leak" se le risorse condivise non vengono ripulite correttamente in TearDownTestSuite().

source: Also, derived classes still have access to shared resources defined as static members, so careful consideration is needed when managing shared resources to avoid memory leaks if shared resources are not properly cleaned up in `TearDownTestSuite()`.
it_it: Inoltre, le classi derivate hanno ancora accesso alle risorse condivise definite come membri statici, quindi è necessaria un'attenta considerazione quando si gestiscono le risorse condivise per evitare "memory leak" se le risorse condivise non vengono ripulite correttamente in `TearDownTestSuite()`.

source: Also, did we tell you that Pointee() works with both raw pointers and smart pointers (std::unique_ptr, std::shared_ptr, etc)?
it_it: Inoltre, abbiamo detto che Pointee() funziona sia con puntatori [raw] sia con puntatori smart (std::unique_ptr, std::shared_ptr, ecc.)?

source: Also, did we tell you that `Pointee()` works with both raw pointers **and** smart pointers (`std::unique_ptr`, `std::shared_ptr`, etc)?
it_it: Inoltre, abbiamo detto che `Pointee()` funziona sia con puntatori [raw] **sia con** puntatori smart (`std::unique_ptr`, `std::shared_ptr`, ecc.)?

source: Also, in C++ 11 and above, a mock method whose return type has a default constructor will return a default-constructed value by default.
it_it: Inoltre, in C++ 11 e versioni successive, un metodo mock il cui tipo restituito ha un costruttore di default, restituirà di default un valore costruito per default.

source: Also, on Windows an uncaught exception will cause a pop-up window, so catching the exceptions allows you to run the tests automatically.
it_it: Inoltre, su Windows un'eccezione non rilevata genererà una finestra popup, quindi catturare le eccezioni consente di eseguire i test automaticamente.

source: Also, remember that DefaultValue<T> is a global resource that potentially affects all living mock objects in your program.
it_it: Ricordarsi, inoltre, che DefaultValue<T> è una risorsa globale che potenzialmente influenza tutti gli oggetti mock attivi nel programma.

source: Also, remember that `DefaultValue<T>` is a global resource that potentially affects *all* living mock objects in your program.
it_it: Ricordarsi, inoltre, che `DefaultValue<T>` è una risorsa globale che potenzialmente influenza *tutti* gli oggetti mock attivi nel programma.

source: Also, the tests must either not modify the state of any shared resource, or, if they do modify the state, they must restore the state to its original value before passing control to the next test.
it_it: Inoltre, i test non devono modificare lo stato di alcuna risorsa condivisa oppure, se modificano lo stato, devono ripristinarlo al suo valore originale prima di passare il controllo al test successivo.

source: Also, you can control the verbosity by specifying --gmock_verbose=error.
it_it: Inoltre, si può controllare la verbosità specificando --gmock_verbose=error.

source: Also, you can control the verbosity by specifying `--gmock_verbose=error`.
it_it: Inoltre, si può controllare la verbosità specificando `--gmock_verbose=error`.

source: Also, you can try to set the death test style to "threadsafe", which is safer but slower, and see if it helps.
it_it: Inoltre, si può provare a impostare lo stile del death test su "threadsafe", che è più sicuro ma più lento, e vedere se aiuta.

source: Also, you can try to set the death test style to `"threadsafe"`, which is safer but slower, and see if it helps.
it_it: Inoltre, si può provare a impostare lo stile del death test su `"threadsafe"`, che è più sicuro ma più lento, e vedere se aiuta.

source: Also, you must first define a test fixture class before using it in a TEST_F(), or you'll get the compiler error "virtual outside class declaration".
it_it: Inoltre, si deve definire una classe per la fixture di test prima di usarla in una TEST_F(), altrimenti si riceve l'errore del compilatore "virtual outside class declaration".

source: Also, you must first define a test fixture class before using it in a `TEST_F()`, or you'll get the compiler error "`virtual outside class declaration`".
it_it: Inoltre, si deve definire una classe per la fixture di test prima di usarla in una `TEST_F()`, altrimenti si riceve l'errore del compilatore "`virtual outside class declaration`".

source: Also, you should call RUN_ALL_TESTS() only once.
it_it: Inoltre, si deve chiamare RUN_ALL_TESTS() solo una volta.

source: Also, you should call `RUN_ALL_TESTS()` only **once**.
it_it: Inoltre, si deve chiamare `RUN_ALL_TESTS()` solo **una volta**.

source: Alternative to Mocking Concrete Classes
it_it: Alternativa ai Mock delle Classi Concrete

source: Alternatively, instead of introducing a new interface, you can rewrite your code to accept a std::function instead of the free function, and then use MockFunction to mock the std::function.
it_it: In alternativa, invece di introdurre una nuova interfaccia, si può riscrivere il codice per accettare una std::function invece della funzione libera per poi utilizzare MockFunction per simulare la std::function.

source: Alternatively, instead of introducing a new interface, you can rewrite your code to accept a std::function instead of the free function, and then use [MockFunction](#MockFunction) to mock the std::function.
it_it: In alternativa, invece di introdurre una nuova interfaccia, si può riscrivere il codice per accettare una std::function invece della funzione libera per poi utilizzare [MockFunction](#MockFunction) per mock-are la std::function.

source: Alternatively, use InvokeWithoutArgs(), which is like Invoke() except that it doesn't pass the mock function's arguments to the callee.
it_it: In alternativa, si usa InvokeWithoutArgs(), che è come Invoke() tranne per il fatto che non passa gli argomenti della funzione fittizia al chiamato.

source: Alternatively, use `InvokeWithoutArgs()`, which is like `Invoke()` except that it doesn't pass the mock function's arguments to the callee.
it_it: In alternativa, si usa `InvokeWithoutArgs()`, che è come `Invoke()` tranne per il fatto che non passa gli argomenti della funzione fittizia al chiamato.

source: Alternatively, you can adjust the value of that flag from within your tests like so:
it_it: In alternativa, si può aggiustare il valore del flag dai test in questo modo:

source: Alternatively, you can use the --gtest_break_on_failure command line flag.
it_it: In alternativa, puoi utilizzare il flag della riga di comando --gtest_break_on_failure.

source: Alternatively, you can use the `--gtest_break_on_failure` command line flag.
it_it: In alternativa, si può utilizzare il flag della riga di comando `--gtest_break_on_failure`.

source: Although std::function supports unlimited number of arguments, MockFunction implementation is limited to ten.
it_it: Sebbene std::function supporti un numero illimitato di argomenti, l'implementazione di MockFunction è limitata a dieci.

source: Although `std::function` supports unlimited number of arguments, `MockFunction` implementation is limited to ten.
it_it: Sebbene `std::function` supporti un numero illimitato di argomenti, l'implementazione di `MockFunction` è limitata a dieci.

source: Although an EXPECT_CALL() statement defined later takes precedence when gMock tries to match a function call with an expectation, by default calls don't have to happen in the order EXPECT_CALL() statements are written.
it_it: Sebbene un'istruzione EXPECT_CALL() definita successivamente abbia la precedenza quando gMock tenta di far corrispondere [to match] una chiamata di funzione con una expectation, per default le chiamate non devono avvenire nell'ordine con cui sono scritte le istruzioni EXPECT_CALL().

source: Although an `EXPECT_CALL()` statement defined later takes precedence when gMock tries to match a function call with an expectation, by default calls don't have to happen in the order `EXPECT_CALL()` statements are written.
it_it: Sebbene un'istruzione `EXPECT_CALL()` definita successivamente abbia la precedenza quando gMock tenta di far corrispondere [to match] una chiamata di funzione con una expectation, per default le chiamate non devono avvenire nell'ordine con cui sono scritte le istruzioni `EXPECT_CALL()`.

source: An AssertionResult object represents the result of an assertion (whether it's a success or a failure, and an associated message).
it_it: Un oggetto AssertionResult rappresenta il risultato di un'asserzione (sia che si tratti di un successo che di un fallimento, e un messaggio associato).

source: An On*End() event will be received by the listeners in the reverse order.
it_it: Un evento On*End() verrà ricevuto dai listener nell'ordine inverso.

source: An `AssertionResult` object represents the result of an assertion (whether it's a success or a failure, and an associated message).
it_it: Un oggetto `AssertionResult` rappresenta il risultato di un'asserzione (sia che si tratti di un successo che di un fallimento, e un messaggio associato).

source: An `On*End()` event will be received by the listeners in the *reverse* order.
it_it: Un evento `On*End()` verrà ricevuto dai listener nell'ordine *inverso*.

source: An alternative to the ACTION* macros is to implement ::testing::ActionInterface<F>, where F is the type of the mock function in which the action will be used.
it_it: Un'alternativa alle macro ACTION* è implementare ::testing::ActionInterface<F>, dove F è il tipo della funzione mock in cui verrà utilizzata l'azione.

source: An alternative to the `ACTION*` macros is to implement `::testing::ActionInterface<F>`, where `F` is the type of the mock function in which the action will be used.
it_it: Un'alternativa alle macro `ACTION*` è implementare `::testing::ActionInterface<F>`, dove `F` è il tipo della funzione mock in cui verrà utilizzata l'azione.

source: An assertion's result can be *success*, *nonfatal failure*, or *fatal failure*.
it_it: Il risultato di un'asserzione può essere *success*, *nonfatal failure* o *fatal failure*.

source: An assertion's result can be success, nonfatal failure, or fatal failure.
it_it: Il risultato di un'asserzione può essere success, nonfatal failure o fatal failure.

source: An event handler function can examine the argument it receives to find out interesting information about the event and the test program's state.
it_it: Una funzione del gestore eventi può esaminare l'argomento che riceve per scoprire informazioni interessanti sull'evento e sullo stato del programma di test.

source: An expectation is active when created, and becomes inactive (aka retires) when a call that has to occur later has occurred.
it_it: Una expectation è attiva quando viene creata e diventa inattiva (ovvero ritirata) quando si verifica una chiamata che deve avvenire in seguito.

source: An expectation is active when created, and becomes inactive (aka *retires*) when a call that has to occur later has occurred.
it_it: Una expectation è attiva quando viene creata e diventa inattiva (ovvero *va in pensione*) quando si verifica una chiamata che deve avvenire in seguito.

source: An in-memory file system would be an example of a fake.
it_it: Un file system in memoria è un esempio di fake.

source: An instance of this class causes a trace to be included in every test failure message generated by code in the scope of the lifetime of the ScopedTrace instance.
it_it: Un'istanza di questa classe fa sì che venga inclusa un trace in ogni messaggio di fallimento del test generato dal codice nello scope della durata dell'istanza di ScopedTrace.

source: An instance of this class causes a trace to be included in every test failure message generated by code in the scope of the lifetime of the `ScopedTrace` instance.
it_it: Un'istanza di questa classe fa sì che venga inclusa un trace in ogni messaggio di fallimento del test generato dal codice nello scope della durata dell'istanza di `ScopedTrace`.

source: An integer type representing time in milliseconds.
it_it: Un tipo intero che rappresenta il tempo in millisecondi.

source: An interesting special case is when we say Times(0).
it_it: Un caso speciale interessante è quando diciamo Times(0).

source: An interesting special case is when we say `Times(0)`.
it_it: Un caso speciale interessante è quando diciamo `Times(0)`.

source: An object of this type causes all expectations encountered in its scope to be put in an anonymous sequence.
it_it: Un oggetto di questo tipo fa sì che tutte le expectation incontrate nel suo scope vengano messe in una sequenza anonima.

source: And
it_it: E

source: And it supports any kind of tests, not just unit tests.
it_it: Supporta qualsiasi tipo di test, non solo le "unit test".

source: And it supports *any* kind of tests, not just unit tests.
it_it: Supporta *qualsiasi* tipo di test, non solo le "unit test".

source: And people might be tempted to use them everywhere.
it_it: E le persone potrebbero essere tentate di usarli ovunque.

source: And suppose you want to test how your code uses System to do I/O, and you just want the file operations to work normally.
it_it: E supponiamo che si voglia testare come il codice utilizza System per eseguire I/O e si voglia semplicemente che le operazioni sui file funzionino normalmente.

source: And suppose you want to test how your code uses `System` to do I/O, and you just want the file operations to work normally.
it_it: E supponiamo che si voglia testare come il codice utilizza `System` per eseguire I/O e si voglia semplicemente che le operazioni sui file funzionino normalmente.

source: And that's that.
it_it: E questo è tutto.

source: And vice versa.
it_it: E viceversa.

source: And, there's a better way to do it: in this case, we expect the calls to occur in a specific order, and we line up the actions to match the order.
it_it: E c'è un modo migliore per farlo: in questo caso, ci aspettiamo che le chiamate avvengano in un ordine specifico e allineiamo le azioni in modo che corrispondano all'ordine.

source: Another example:
it_it: Un altro esempio:

source: Another way is via the InSequence() clause (not the same as the InSequence class), which we borrowed from jMock 2.
it_it: Un altro modo è tramite la clausola InSequence() (diversa dalla classe InSequence), che abbiamo preso in prestito da jMock 2.

source: Another way is via the `InSequence()` clause (not the same as the `InSequence` class), which we borrowed from jMock 2.
it_it: Un altro modo è tramite la clausola `InSequence()` (diversa dalla classe `InSequence`), presa in prestito da jMock 2.

source: Another way to do it: you can introduce a thin layer FooAdaptor on top of Foo and code to this new interface.
it_it: C'è un altro modo per farlo: si può introdurre un sottile layer FooAdaptor al di sopra di Foo e inserire il codice per questa nuova interfaccia.

source: Another way to do it: you can introduce a thin layer `FooAdaptor` on top of `Foo` and code to this new interface.
it_it: C'è un altro modo per farlo: si può introdurre un sottile layer `FooAdaptor` al di sopra di `Foo` e inserire il codice per questa nuova interfaccia.

source: Another way to test private members is to refactor them into an implementation class, which is then declared in a *-internal.h file.
it_it: Un altro modo per testare i membri privati è quello di rifattorizzarli in una classe di implementazione, che viene poi dichiarata in un file *-internal.h.

source: Another way to test private members is to refactor them into an implementation class, which is then declared in a `*-internal.h` file.
it_it: Un altro modo per testare i membri privati è quello di rifattorizzarli in una classe di implementazione, che viene poi dichiarata in un file `*-internal.h` file.

source: Any changes one test makes to the fixture do not affect other tests.
it_it: Qualsiasi modifica apportata da un test alla fixture non influisce sugli altri test.

source: Any prior initialization done in the main function will be accessible from the parameter generator, for example, the results of flag parsing.
it_it: Qualsiasi inizializzazione precedente eseguita nella funzione main sarà accessibile dal generatore di parametri, ad esempio i risultati del parsing dei flag.

source: Any prior initialization done in the `main` function will be accessible from the parameter generator, for example, the results of flag parsing.
it_it: Qualsiasi inizializzazione precedente eseguita nella funzione `main` sarà accessibile dal generatore di parametri, ad esempio i risultati del parsing dei flag.

source: Anything that can be streamed to an ostream can be streamed to an assertion macro--in particular, C strings and string objects.
it_it: Tutto ciò che può essere inviato a un ostream e può essere inviato ad una macro di asserzione--in particolare, stringhe C e oggetti string.

source: Anything that can be streamed to an ostream can be streamed to an assertion macro—in particular, C strings and string objects.
it_it: Tutto ciò che può essere inviato in streaming a un ostream può essere inviato in streaming a una macro di asserzione, in particolare le stringhe C e gli oggetti stringa.
